//: Playground - noun: a place where people can play

// Задание 1.

//1. Попробуйте сохранить в память Массив из своих структур
//2. Достать его из памяти
//3. Написать функцию, которая будет добавлять в этот массив элемент (достать + изменить + сохранить)

// Задание 2.

// 1. Сделайте струтуру Song (где-то это уже было)

// 2. Сделайте структуру Playlist, внутри массив Song, все такое
// Можете просто скопировать из прошлых дз

// 3. Сделайте таблицу, в каждой ячейке которой будет информация о плейлисте, а по нажатию будет открываться новый экран

// 4. На нем должна быть еще одна таблица с песнями

// 5. При нажатии на песню появляется ещё один экран-плеер (Можете опять же скопировать прошлый код)

// Задание 3.

// Попробуйте сделать вторую закладку, на которой будет 1 экран
// На нем 2 текстовый поля и кнопка добавить
// Соответственно функциональность заключается в добавлении новой песни в память


// Песни это только пример. По желанию конечно можете сделать тот же справочник, словарь, список покупок или что-нибудь похожее
