//: Playground - noun: a place where people can play

import UIKit

// Задание 1

// Создайте приложение - справочник (Таблица, в какждой ячейке которой есть слово и его толкование или перевод + по желанию ещё что-то)

// Желательно использовать свою структуру Word

// Задание 2
// 1. Создайте протокол Delegate с одной функцией didTap(index: Int) или что-нибудь похожее
// 2. На каждую ячейку таблицы повесьте кнопку
// 3. Создайте переменную-делегат в классе вашей ячейке
// 4. Не забудьте назначать его на что-нибудь, соответсвующее протоколу Delegate
// 5. Попробуйте сначала просто писать "ok" при нажатии на кнопку
// 6. А теперь сделайте, чтобы по нажатию на кнопку чуть выше таблицы (оставьте там место изначально) появлялся лейбл с Индексом выбранной ячейки

// 7. А теперь сделайте, чтобы этот лейбл показывал слово, которое написано на выбранной ячейке
